backend/controllers/SubmitController.php

SELECT * FROM `webSource` WHERE (`status`=0) AND (`isDelete`=0) LIMIT 30
SELECT COUNT(*) FROM `webSource` WHERE (`status`=0) AND (`isDelete`=0)
---
    public function actionList(){
        $total =  DbWebSource::find()->where(['status'=>0,'isDelete'=>0])->count();
        $page = new Pagination(['totalCount' => $total,'pageSize'=>30]);
        $list = DbWebSource::find()
            ->where(['status'=>0,'isDelete'=>0])
            ->offset($page->offset)
            ->limit($page->limit)
            ->asArray()
            ->all();

SELECT * FROM `webSource` WHERE `id` IS NULL
SELECT * FROM `webSubject` WHERE `isDelete`=0
---
    public function actionWeb()
    {
        $model = new WebSource();
        $agreement = Yii::$app->params['web-agreement'];
        $model->scenario = 'edit';
        $id= Yii::$app->request->get('id');
        $info = DbWebSource::find()->where(['id'=>$id])->asArray()->one();
        $subjectList = DbWebSubject::find()->where(['isDelete'=>0,'level'=>0])->asArray()->all();