backend/controllers/SubmitController.php

    public function actionList(){
        $total =  DbWebSource::find()->where(['isDelete'=>0])->count();
        $page = new Pagination(['totalCount' => $total,'pageSize'=>30]);
        $list = DbWebSource::find()
            ->where(['isDelete'=>0])
            ->offset($page->offset)
            ->limit($page->limit)
            ->asArray()
            ->all();
---
SELECT COUNT(*) FROM `webSource` WHERE `isDelete`=0
SELECT * FROM `webSource` WHERE `isDelete`=0 LIMIT 30