backend/models/WebSubRelation.php

DELETE FROM `webSubRelation` WHERE `webId`='55'
---
    public function bindSubjectIds($webId,$subjectIds){

        //删除原来的关系
        $one =  DbWebSubRelation::findOne(['webId'=>$webId])->delete();