backend/models/WebSubRelation.php

SELECT * FROM `webSubRelation` WHERE `webId`='39'
INSERT INTO `webSubRelation` (`subId`, `webId`, `level`) VALUES (1, 39, 0)
INSERT INTO `webSubRelation` (`subId`, `webId`, `level`) VALUES (6, 39, 1)
---
    public function bindSubjectIds($webId,$subjectIds){

        //删除原来的关系
        $one =  DbWebSubRelation::findOne(['webId'=>$webId]);
        if($one){
            $one->isDelete=1;
            $one->save();
        }
        $db = new DbWebSubRelation();
        //存储当前关系
        if(isset($subjectIds[0])){
          foreach ($subjectIds[0] as $v){
              $db->subId=$v;
              $db->webId=$webId;
              $db->level=0;
              $db->save();
            echo $db->find()->createCommand()->getRawSql();die;
          }
        }
        if(isset($subjectIds[1])){
            foreach ($subjectIds[1] as $v){
                $db->subId=$v;
                $db->webId=$webId;
                $db->level=1;
                $db->save();