backend/models/WebSource.php

SELECT * FROM `webSource` WHERE `id`='39'
UPDATE `webSource` SET `uId`=32, `browseNum`=4854, `collectionNum`=134, `likeNum`=968, `shareNum`=112, `commentNum`=0, `downloadNum`=93, `price`=50, `updateTime`='1553670574', `status`=1, `IE`=8, `isIE`=1, `isFirefox`=1, `isChrome`=1, `isSafari`=1 WHERE `id`=39
---
    public function addWebSource()
    {
        $source = DbWebSource::findOne(['id'=>$this->id]);
        $source->uId = DbUser::getSystemUid();
        $source->title = $this->title;
        $source->keyword = $this->keyword;
        $source->describe = $this->describe;
        $source->manual = $this->manual;
        $source->oldUrl = $this->oldUrl;
        $source->coverUrl=$this->coverUrl;
        $source->soureUrl=$this->resources;
        $source->previewUrl= str_ireplace('resource','preview',$this->soureUrl);
        $source->browseNum = $this->browseNum;
        $source->collectionNum = $this->collectionNum;
        $source->likeNum = $this->likeNum;
        $source->shareNum = $this->shareNum;
        $source->commentNum = $this->commentNum;
        $source->downloadNum = $this->downloadNum;
        $source->IE = $this->IE;
        $source->isIE = $this->isIE;
        $source->isFirefox = $this->isFirefox;
        $source->isChrome = $this->isChrome;
        $source->isSafari = $this->isSafari;
        $source->updateTime = time();