backend/models/WebSource.php

INSERT INTO `webSource` (`uId`, `title`, `keyword`, `describe`, `manual`, `oldUrl`, `coverUrl`, `soureUrl`, `previewUrl`, `browseNum`, `collectionNum`, `likeNum`, `shareNum`, `commentNum`, `downloadNum`, `IE`, `isIE`, `isFirefox`, `isChrome`, `isSafari`, `updateTime`, `registerTime`, `price`, `status`) VALUES (32, '餐饮公司响应式网站', '餐饮网站,响应式模板', '', NULL, '', '/previewImg/190329/2429094523.jpg', '/resource/190329/2117961394.zip', '/preview/190329/2117961394', 4673, 107, 869, 272, 0, 82, 8, 1, 1, 1, 1, '1553850986', '2019-03-29 09:16:26', 0, 1)
---
    public function upload()
    {
          $path =Yii::$app->params['upload']['web'].'/'.date('ymd',time()).'/';
        if ( !is_dir($path)) {
             mkdir($path, 0777, true);
            chmod($path, 0777);
        }
        if ($this->validate()) {
            //生成文件名
            $fileName =rand(100000, 999999). '.'.$this->resources->extension;
            $this->soureUrl =$path.$fileName;
            if(!$this->resources->saveAs($this->soureUrl)){