frontend/models/LoginForm.php

SELECT * FROM `user` WHERE (`userName`='2579552905@qq.com') OR (`email`='2579552905@qq.com')
---
    public function validatePassword($attribute, $params)
    {
        if (!$this->hasErrors()) {
            $user = DbUser::find()
                ->where(['userName'=>$this->account])
                ->orWhere(['email'=>$this->account])
                ->one();

SELECT * FROM `user` WHERE (`userName`='2579552905@qq.com') OR (`email`='2579552905@qq.com')
---
    public function login()
    {
        $userInfo = DbUser::find()
            ->where(['userName'=>$this->account])
            ->orWhere(['email'=>$this->account])
            ->asArray()
            ->one();

SELECT * FROM `user` WHERE `uId`='32'
UPDATE `user` SET `logoutTime`='1554116463' WHERE (`uId`=32) AND (`money`=0)
SELECT * FROM `userLogin` WHERE `uid`='32' ORDER BY `id` DESC
UPDATE `userLogin` SET `logoutTime`='1554116463' WHERE `id`=39
---
    public function logout()
    {
        $redisKey=Yii::$app->params['redisUserinfoKey'];
        $result = Yii::$app->session->get($redisKey);
        if(!$result) return true;
        $result = json_decode($result,true);
        $user = DbUser::findOne(['uId'=>$result['uId']]);
        $user->logoutTime = time();
        $user->save();
        $userLogin =LogUserLogin::find()->where(['uid'=>$result['uId']])->orderBy(['id'=>SORT_DESC])->one();
        $userLogin->logoutTime= time();
        $userLogin->save();

SELECT * FROM `user` WHERE `email`='2579552905@qq.com'
UPDATE `user` SET `password`='$2y$13$8wc1Ic3nowCIsk0TPDelDe1vo.twdhy0XcV3EUwCnvxZOnAMvgegO', `updateTime`='1554116150', `salt`='U0CFDs_M8k8-WY0g9id283BjOHZ367Wa' WHERE (`uId`=32) AND (`money`=0)
---
    public function forgetpassword(){
        $user = DbUser::findOne(['email'=>$this->email]);
        $user->salt =Yii::$app->security->generateRandomString();
        $user->password = Yii::$app->security->generatePasswordHash($this->password.$user->salt);
        $user->updateTime = $this->updateTime;
        //添加记录
        (new UserForgetPasswordLog())->addLog($user->uId);
        return $result = $user->save();