frontend/models/User.php

    public static function findByEmail($email)
    {
       return DbUser::findOne(['email'=>$email,'isDelete'=>0]);
---
SELECT * FROM `user` WHERE (`email`='2579552905@qq.com') AND (`isDelete`=0)

    public static function findBlackByEmail($email)
    {
        return DbUser::findOne(['email'=>$email,'status'=>-1,'isDelete'=>0]);
---
SELECT * FROM `user` WHERE (`email`='2579552905@qq.com') AND (`status`=-1) AND (`isDelete`=0)