frontend/models/UserLoginLog.php

INSERT INTO `userLogin` (`uid`, `loginTime`, `ip`, `client`, `country`, `address`) VALUES (32, '1554116473', '192.168.33.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/73.0.3683.86 Safari/537.36', '局域网', '对方和您在同一内部网')
---
    public function addLog($uid){
        $userLoginLog = new LogUserLogin();
        $userLoginLog->uid=$uid;
        $userLoginLog->loginTime=time();
        $userLoginLog->ip = \Yii::$app->request->getUserIP();
        $userLoginLog->client = \Yii::$app->request->getUserAgent();
        $ipLocation = new Ip2Location();
        $locationModel = $ipLocation->getLocation( $userLoginLog->ip);
        $city = $locationModel->toArray();
        $userLoginLog->country = $city['country'];
        $userLoginLog->address = $city['area'];
        return $userLoginLog->save();